using System;
namespace Homework5
{
	class Programm5
	{
		static void Main()
		{
			// Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
			//======= Сами функции в файле exe34.cs==================
			// System.Console.WriteLine("let's find out the number of even numbers in the array.");
			// System.Console.WriteLine("Please enter length of the array: ");
			// int length = Convert.ToInt32(Console.ReadLine());
			// PlusCounter counter = new PlusCounter();
			// int[] randomArr = counter.randomArray(length);
			// counter.showArr(randomArr);
			// int result = counter.counter(randomArr);
			// System.Console.WriteLine($"The number of even numbers is: {result}");
			//======= Сами функции в файле exe34.cs==================

			// Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.
			//======= Сами функции в файле exe36.cs==================
			// System.Console.WriteLine("let's find out the summ of the odd index numbers.");
			// System.Console.WriteLine("Please enter length of the array: ");
			// int length = Convert.ToInt32(Console.ReadLine());
			// SummOdd summ = new SummOdd();
			// int[] randomArr = summ.randomArray(length);
			// int result = summ.summFunc(randomArr);
			// Console.WriteLine($"The number of even numbers is: {result}");
			//======= Сами функции в файле exe36.cs==================

			// Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
			//======= Сами функции в файле exe38.cs==================
			// System.Console.WriteLine("let's find out difference between the maximum and minimum array elements.");
			// System.Console.WriteLine("Please enter length of the array: ");
			// int length = Convert.ToInt32(Console.ReadLine());
			// MinMax sumMinMax = new MinMax();
			// double[] randomArr = sumMinMax.randomArray(length);
			// double[] mmArray = sumMinMax.minmax(randomArr);
			// double result = sumMinMax.diff(mmArray);
			// Console.WriteLine($"The difference between the maximum and minimum array elements. is: {result}");
			//======= Сами функции в файле exe38.cs==================
		}
	}
}