using System;
namespace Seminar4
{
	class SeminarPrigramm
	{
		static void Main()
		{
			// Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
			// Console.Write("Inpute your number, please: ");
			// int num = Convert.ToInt32(Console.ReadLine());
			// Console.Write(Summ(num));
			// Напишите программу, факториал
			// Console.Write("Inpute your number, please: ");
			// int num = Convert.ToInt32(Console.ReadLine());
			// Console.Write(Summ(num));

		}
		// Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
		// int Summ(int number)
		// {
		// 	int result = 0;
		// 	for (byte i = 0; i <= number; i++)
		// 	{
		// 		result += i;
		// 	}
		// 	return result;
		// }
		// Напишите программу, факториал
		// int Summ(int number)
		// {
		// 	int result = 1;
		// 	for (byte i = 1; i <= number; i++)
		// 	{
		// 		result *= i;
		// 	}
		// 	return result;
		// }
	}
}